app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
OR `phone` = 'admin'
 LIMIT 1
---
    public function loginProcess()
    {
        $adminModel = new AdminModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $admin = $adminModel->where('username', $username)->orWhere('phone', $username)->first();

SELECT *
FROM `admin`
WHERE `phone` = '+6282111614532'
 LIMIT 1
INSERT INTO `password_resets` (`phone`, `token`, `expires_at`) VALUES ('+6282111614532', '3d8ef2cab8c96e6d82cff2a217d97e0b3a7a0164b6c530a4dbb86f85e27f4079e55246b5582baa54c1b61819016f5249a2cd', '2024-08-03 17:01:23')
---
    public function forgotPasswordProcess()
    {
        $adminModel = new AdminModel();
        $passwordResetModel = new PasswordResetModel();

        $phone = $this->request->getVar('phone');
        $admin = $adminModel->where('phone', $phone)->first();

        if (!$admin) {
            return redirect()->back()->with('error', 'Phone number not found');
        }

        $token = bin2hex(random_bytes(50));
        $expires_at = Time::now()->addHours(1);

        $passwordResetModel->insert([
            'phone' => $phone,
            'token' => $token,
            'expires_at' => $expires_at
        ]);

SELECT *
FROM `password_resets`
WHERE `token` = '3d8ef2cab8c96e6d82cff2a217d97e0b3a7a0164b6c530a4dbb86f85e27f4079e55246b5582baa54c1b61819016f5249a2cd'
 LIMIT 1
SELECT *
FROM `admin`
WHERE `phone` = '+6282111614532'
 LIMIT 1
UPDATE `admin` SET `password` = '$2y$10$XaCRvFdNiCzybKsqrxbawuo3nx2fmXxa1Y9UuVy.AdqgUEut1MB.y'
WHERE `admin`.`id` IN ('5')
DELETE FROM `password_resets`
WHERE `phone` = '+6282111614532'
---
    public function resetPasswordProcess()
    {
        $passwordResetModel = new PasswordResetModel();
        $adminModel = new AdminModel();

        $token = $this->request->getVar('token');
        $password = $this->request->getVar('password');
        $passwordConfirm = $this->request->getVar('password_confirm');

        // Check if password and confirm password match
        if ($password !== $passwordConfirm) {
            return redirect()->back()->with('error', 'Password and Confirm Password do not match.')->withInput();
        }

        $passwordReset = $passwordResetModel->where('token', $token)->first();

        if (!$passwordReset || Time::now()->isAfter($passwordReset['expires_at'])) {
            return redirect()->back()->with('error', 'Token is invalid or has expired');
        }

        $admin = $adminModel->where('phone', $passwordReset['phone'])->first();

        $adminModel->update($admin['id'], ['password' => password_hash($password, PASSWORD_DEFAULT)]);

        $passwordResetModel->where('phone', $passwordReset['phone'])->delete();