app/Controllers/Doctors.php

SELECT *
FROM `doctors`
---
    public function all()
    {
        $doctorModel = new DoctorModel();
        $data['doctors'] = $doctorModel->findAll();