app/Controllers/Patients.php

SELECT *
FROM `patients`
---
    public function all()
    {
        $patientModel = new PatientModel();
        $data['patients'] = $patientModel->findAll();

INSERT INTO `patients` (`first_name`, `last_name`, `nik`, `disease`) VALUES ('Fikri', 'Anshori', '3211182302060002', 'cacing kremi')
---
    public function addProcess()
    {
        $patientModel = new PatientModel();

        $data = [
            'first_name' => $this->request->getPost('first_name'),
            'last_name' => $this->request->getPost('last_name'),
            'nik' => $this->request->getPost('nik'),
            'disease' => $this->request->getPost('disease')
        ];

        $patientModel->insert($data);

SELECT *
FROM `patients`
WHERE `patients`.`id` = '1'
---
    public function edit($id)
    {
        $patientModel = new PatientModel();
        $data['patient'] = $patientModel->find($id);